In [ ]:
import pandas as pd

city1=['Rajbari','Faridpur','Dhaka']
df=pd.DataFrame(city1)
df  #Prining a simple list

          0          1
0   Rajbari     Sylhet
1  Faridpur  Sunamganj
2     Dhaka  Rangamati

In [ ]:
city2=['Sylhet','Sunamganj','Rangamati']

df2= pd.DataFrame(zip(city1,city2)) # Zipping both lists 
df2

          0          1
0   Rajbari     Sylhet
1  Faridpur  Sunamganj
2     Dhaka  Rangamati

In [ ]:
df3= pd.DataFrame(zip(city1,city2),columns=('The city Ive visisted','The city Ive not visited')) #Creating the name of columns 
df3

  The city Ive visisted The city Ive not visited
0               Rajbari                   Sylhet
1              Faridpur                Sunamganj
2                 Dhaka                Rangamati

In [9]:
df4= pd.DataFrame(zip(city1,city2),columns=('The city Ive visisted','The city Ive not visited'),index=('City_1','City_2','City_3'))
#Creating column names and index name of the table
df4

       The city Ive visisted The city Ive not visited
City_1               Rajbari                   Sylhet
City_2              Faridpur                Sunamganj
City_3                 Dhaka                Rangamati

In [ ]:
df4.shape  # Showing the shape of a Data Frame

(3, 2)

In [20]:
dict1={
    'City1':city1,
    'City2':city2
   
}
df5=pd.DataFrame(dict1)
df5

      City1      City2
0   Rajbari     Sylhet
1  Faridpur  Sunamganj
2     Dhaka  Rangamati